app/controllers/user_controller.rb

  def wall
    @latest_bricks = @current_user.bricks.find :all, :order => 'created_at desc', :limit => 8
---
SELECT * FROM `bricks` WHERE (`bricks`.`user_id` = 3) ORDER BY created_at desc LIMIT 1

  def newbrick
    @brick = Brick.new params[:brick]
    @brick.user_id = @current_user.id
    if request.post? and @brick.save
---
INSERT INTO `bricks` (`user_id`, `title`, `text`, `created_at`, `updated_at`) VALUES(2, 'a', 'a', '2010-02-06 11:16:46', '2010-02-06 11:16:46')