app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`login` = '3' AND `users`.`password` = 'w') LIMIT 1
---
  def login
    if request.post? # jestli byl poslan pozadavek na login
      @current_user = User.find_by_login_and_password params[:user][:login], Digest::SHA1.hexdigest(params[:user][:password])

INSERT INTO `users` (`login`, `name`, `email`, `web`, `group`, `created_at`, `updated_at`, `password`) VALUES('3', '3', '3', '3', NULL, '2010-02-05 15:44:33', '2010-02-05 15:44:33', 'w')
---
  def register

    # stop registraci
    flash[:error] = "Registrace zrusene, bylo tu moc lidi, my asocialove na takove davy nejsme zvykli."
    redirect_to :controller => 'faceboo'

    @user = User.new params[:user]
    if request.post? and @user.save

SELECT * FROM `bricks` WHERE (`bricks`.user_id = 3) ORDER BY bricks.id DESC LIMIT 1
---
  def show
    @latest_brick = @current_user.bricks.find :last

UPDATE `users` SET `name` = 'Alda Aldikovic', `password` = '99c94d5f169cd2b039ac9a3f0d6ccd88eafc4ae4', `updated_at` = '2010-02-10 13:55:01' WHERE `id` = 2
---
  def edit
    @user = @current_user
    if request.post?
      @user.attributes = params[:user]
      if @user.save

DELETE FROM `bricks` WHERE (`id` IN (20))
---
  def delete
    @b = @current_user.bricks
    @b.each { |r|
      r.delete