app/controllers/wall_controller.rb

SELECT * FROM `bricks` WHERE (`bricks`.user_id = 3) ORDER BY created_at desc LIMIT 1,8
SELECT count(*) AS count_all FROM `bricks` WHERE (`bricks`.user_id = 3)
SELECT * FROM `users` WHERE (id != 7) ORDER BY rand() LIMIT 8
---
  def index
    if params[:id].blank? or params[:id].to_i < 1
      @current_page = 1
    else
      @current_page = params[:id].to_i
    end

    @latest_bricks = @current_user.bricks.find :all, :order => 'created_at desc', :limit => "#{(@current_page - 1) * 8}, 8"
    @pages = (@current_user.bricks_count / 8.0).ceil
    @enemies = User.find :all, :order => 'rand()', :conditions => "id != #{@current_user.id}", :limit => 8

INSERT INTO `bricks` (`user_id`, `title`, `text`, `created_at`, `updated_at`) VALUES(3, 'po', 'hura', '2010-02-07 11:26:39', '2010-02-07 11:26:39')
---
  def newbrick
    @brick = Brick.new params[:brick]
    @brick.user_id = @current_user.id
    if request.post? and @brick.save

SELECT * FROM `bricks` WHERE (`bricks`.`id` = '44') AND (`bricks`.user_id = 2) LIMIT 1
DELETE FROM `bricks` WHERE (`id` IN (26))
---
  def delete
    #@brick = Brick.find_by_id_and_user_id params[:id], @current_user.id
    @brick = @current_user.bricks.find_by_id params[:id]
    unless @brick.blank?
      @brick.destroy #delete

SELECT * FROM `bricks` WHERE (`bricks`.`id` = '30' AND `bricks`.`user_id` = 2) LIMIT 1
UPDATE `bricks` SET `title` = 'TODO', `text` = 'fotoalbum', `updated_at` = '2010-02-10 20:08:06' WHERE `id` = 30
---
  def edit
    @brick = Brick.find_by_id_and_user_id params[:id], @current_user.id
    if request.post?
      @brick.attributes= params[:brick]
      if @brick.save